app/controllers/slogans_controller.rb

SELECT "slogans".* FROM "slogans"
---
  def index
    @slogans = Slogan.all

INSERT INTO "slogans" ("first_name", "last_name", "email", "slogan", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @slogan = Slogan.new(slogan_params)

    respond_to do |format|
      if @slogan.save

SELECT  "slogans".* FROM "slogans" WHERE "slogans"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
    def set_slogan
      @slogan = Slogan.find(params[:id])